Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [10]:
import pandas
pandas.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [11]:
l = [1,2,3,4,5,6,7,8,9,10]

In [12]:
pandas.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [14]:
pandas.DataFrame({'name' : ['Alice' ,'Bod','Claire' ],
                 'age' :[ 25 , 30 , 27 ] ,
                 'Gander' : ['Female' , 'Make' , 'Female'] })

     name  age  Gander
0   Alice   25  Female
1     Bod   30    Make
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure consisting of rows and columns, similar to a spreadsheet or SQL table. It is one of the most commonly used data structures in pandas for data manipulation and analysis.

On the other hand, a pandas Series is a one-dimensional labeled array capable of holding data of any type. It can be thought of as a single column of a DataFrame.

In [17]:
#example :
df = pandas.DataFrame({'a':[1,2,3,4,5],
                 'b' :[6,7,8,9,10],
                 'c' :[11,12,13,14,15]})

In [18]:
df['a']

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [19]:
type(df['a'])

pandas.core.series.Series

In [20]:
type(df)

pandas.core.frame.DataFrame

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

There are some functions :
head(): Returns the first n rows of the DataFrame. It is useful for quickly inspecting the data.
tail(): Returns the last n rows of the DataFrame. It is useful for quickly inspecting the data.
describe(): Generates descriptive statistics of the DataFrame. It gives the count, mean, standard deviation, minimum, maximum, and quartile values of each column.
drop(): Drops specified rows or columns from the DataFrame.
groupby(): Groups the data in the DataFrame by one or more columns and applies a function to each group.
merge(): Combines two or more DataFrames into a single DataFrame by joining on one or more common columns.

In [21]:
df = pandas.DataFrame({'a':[1,2,3,4,5],
                 'b' :[6,7,8,9,10],
                 'c' :[11,12,13,14,15]})

In [24]:
df.head(2)

   a  b   c
0  1  6  11
1  2  7  12

In [25]:
df.tail(2)

   a   b   c
3  4   9  14
4  5  10  15

In [26]:
df.describe()

              a          b          c
count  5.000000   5.000000   5.000000
mean   3.000000   8.000000  13.000000
std    1.581139   1.581139   1.581139
min    1.000000   6.000000  11.000000
25%    2.000000   7.000000  12.000000
50%    3.000000   8.000000  13.000000
75%    4.000000   9.000000  14.000000
max    5.000000  10.000000  15.000000

In [28]:
df.drop('a',axis = 1 , inplace = True)

In [29]:
df

    b   c
0   6  11
1   7  12
2   8  13
3   9  14
4  10  15

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Both Series and DataFrame are mutable in nature, meaning that their values can be changed after they are created. On the other hand, Panel is considered to be deprecated in recent versions of pandas and replaced by MultiIndex. However, when it was present in older versions, it was also mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [40]:
names = pandas.Series(['dhara','disha','priya','riya'])

In [41]:
student_ids = pandas.Series([101,102,103,104])

In [42]:
marks =  pandas.Series([98,45,12,67])

In [43]:
pandas.DataFrame({'name' :names , 'student_id' : student_ids , 'mark' : marks})

    name  student_id  mark
0  dhara         101    98
1  disha         102    45
2  priya         103    12
3   riya         104    67